git-file-renames.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="https://cdn.simplecss.org/simple.min.css" />
</head>
<body>
<div id="content" class="content">
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7263f5e">The correct way</a>
<ul>
<li><a href="#orge41c756">One: Stage both files at the same time</a></li>
<li><a href="#orgee1f35f">Two: Use git-mv</a></li>
</ul>
</li>
<li><a href="#org543533a">Why correct?</a></li>
<li><a href="#orgc5262e0">The incorrect way</a></li>
<li><a href="#org3ac17a0">In the context of <code>git merge</code></a>
<ul>
<li><a href="#org2456356">The issue with the incorrect way:</a></li>
<li><a href="#org74dd0be">The correct way:</a></li>
</ul>
</li>
</ul>
</div>
</div>
<p>
If you move a file in git, then commit the deletion and addition at the same time.
</p>

<p>
Here is one of the ways I can tell somebody is not on a high git magician power level:
</p>

<p>
Renaming a file and have separate commits for the creation and deletion of the files.
</p>

<div id="outline-container-org7263f5e" class="outline-2">
<h2 id="org7263f5e">The correct way</h2>
<div class="outline-text-2" id="text-org7263f5e">
<p>
There is 2 ways I know to rename files correctly:
</p>
</div>

<div id="outline-container-orge41c756" class="outline-3">
<h3 id="orge41c756">One: Stage both files at the same time</h3>
<div class="outline-text-3" id="text-orge41c756">
<div class="org-src-container">
<pre class="src src-shell">rm -rf rename-files-demo
mkdir rename-files-demo
git init rename-files-demo
<span style="font-weight: bold;">cd</span> rename-files-demo
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'first hi'</span> &gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">"Initial"</span>
<span style="font-weight: bold;">cd</span> rename-files-demo
mv myfile my-better-file
git add myfile my-better-file
git status
</pre>
</div>
</div>
</div>

<div id="outline-container-orgee1f35f" class="outline-3">
<h3 id="orgee1f35f">Two: Use <a href="https://www.git-scm.com/docs/git-mv">git-mv</a></h3>
<div class="outline-text-3" id="text-orgee1f35f">
<div class="org-src-container">
<pre class="src src-shell">rm -rf rename-files-demo
mkdir rename-files-demo
git init rename-files-demo
<span style="font-weight: bold;">cd</span> rename-files-demo
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'first hi'</span> &gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">"Initial"</span>
git mv myfile my-better-file
git status
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org543533a" class="outline-2">
<h2 id="org543533a">Why correct?</h2>
<div class="outline-text-2" id="text-org543533a">
<p>
On this level of detail, the keyword here is <code>renamed</code>.
Observe how <code>git log follow</code> tracks the whole history of our file:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> rename-files-demo
git commit -m <span style="font-style: italic;">"Rename the file"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'more'</span> &gt; my-better-file
git add my-better-file
git commit -m <span style="font-style: italic;">"More better file"</span>
git log --follow --oneline my-better-file
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc5262e0" class="outline-2">
<h2 id="orgc5262e0">The incorrect way</h2>
<div class="outline-text-2" id="text-orgc5262e0">
<p>
Let's delete our demo and make some commits.
This time we do not add the deletion and creation in the same commit,
but 2:
</p>

<div class="org-src-container">
<pre class="src src-shell">rm -rf rename-files-demo
mkdir rename-files-demo
git init rename-files-demo
<span style="font-weight: bold;">cd</span> rename-files-demo
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'first hi'</span> &gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">"Initial"</span>
<span style="font-weight: bold;">cd</span> rename-files-demo
mv myfile my-better-file
git add myfile
git commit -m <span style="font-style: italic;">"Remove myfile"</span>
git add my-better-file
git commit -m <span style="font-style: italic;">"Add my-better-file"</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'more'</span> &gt; my-better-file
git add my-better-file
git commit -m <span style="font-style: italic;">"More better file"</span>
</pre>
</div>

<p>
Commit 1:
</p>

<pre class="example" id="org9cce760">
1 file changed, 1 deletion(-)
</pre>

<p>
Commit 2:
</p>

<pre class="example" id="orgc58aaa1">
1 file changed, 1 insertion(+)
create mode 100644 my-better-file
</pre>

<p>
And git log &#x2013;follow is broken:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> rename-files-demo
git log --oneline --follow --oneline -- my-better-file
</pre>
</div>

<p>
Now, if I want to log out the history of the file, I see at the bottom
usually something like "Move the files into this dir".
</p>
</div>
</div>

<div id="outline-container-org3ac17a0" class="outline-2">
<h2 id="org3ac17a0">In the context of <code>git merge</code></h2>
<div class="outline-text-2" id="text-org3ac17a0">
</div>
<div id="outline-container-org2456356" class="outline-3">
<h3 id="org2456356">The issue with the incorrect way:</h3>
<div class="outline-text-3" id="text-org2456356">
<p>
Arguably the more important context of where this starts mattering is
<code>git merge</code>.
</p>

<p>
Here the same <b>inccorrect</b> setup again
</p>

<div class="org-src-container">
<pre class="src src-shell">rm -rf rename-files-demo
mkdir rename-files-demo
git init rename-files-demo
<span style="font-weight: bold;">cd</span> rename-files-demo

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">setup myfile</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'first hi'</span> &gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">"Initial"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">make 2 commits to rename it</span>
mv myfile my-better-file
git add myfile
git commit -m <span style="font-style: italic;">"Remove myfile"</span>
git add my-better-file
git commit -m <span style="font-style: italic;">"Add my-better-file"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Make additional changes to myfile on master</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'more'</span> &gt; my-better-file
git add my-better-file
git commit -m <span style="font-style: italic;">"More better file"</span>

</pre>
</div>

<p>
Let's say we hacked on myfile on a feature branch, then merge feature
into master:
</p>

<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold;">cd</span> rename-files-demo
git checkout -b feature HEAD~3
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'lul'</span> &gt;&gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">'Add on feature branch'</span>
git checkout master
git merge feature
git status
</pre>
</div>

<p>
The key here is
</p>

<blockquote>
<p>
CONFLICT (modify/delete): myfile deleted in HEAD and modified in feature.  Version feature of myfile left in tree.
</p>
</blockquote>

<p>
We have 2 versions of myfile, but git is asking us to fix a conflict
of "we deleted".
But the real conflict we are interested in is between feature branchs <code>myfile</code>
and master branchs <code>my-better-file</code>.
This is annoying in the best case. And really can be a recipe for disaster.
</p>
</div>
</div>

<div id="outline-container-org74dd0be" class="outline-3">
<h3 id="org74dd0be">The correct way:</h3>
<div class="outline-text-3" id="text-org74dd0be">
<p>
Let's try this out in the correct way:
</p>

<div class="org-src-container">
<pre class="src src-shell">rm -rf rename-files-demo
mkdir rename-files-demo
git init rename-files-demo
<span style="font-weight: bold;">cd</span> rename-files-demo

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">setup myfile</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'first hi'</span> &gt;&gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">"Initial"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">rename it</span>
mv myfile my-better-file
git add -a
git commit -m <span style="font-style: italic;">"Rename the file"</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">Make additional changes to myfile on master</span>
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'more'</span> &gt;&gt; my-better-file
git add my-better-file
git commit -m <span style="font-style: italic;">"More better file"</span>

<span style="font-weight: bold; font-style: italic;">#  </span><span style="font-weight: bold; font-style: italic;">make a feature branch with changes to the original 'myfile'</span>
git checkout -b feature HEAD~2
<span style="font-weight: bold;">echo</span> <span style="font-style: italic;">'lul'</span> &gt;&gt; myfile
git add myfile
git commit -m <span style="font-style: italic;">'Add on feature branch'</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">merge feature into master</span>
git checkout master
git merge feature
git status
cat my-better-file
</pre>
</div>

<p>
funny, these things are not as easy as I thought they are
</p>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="creator"><a href="https://www.gnu.org/software/emacs/">Emacs</a> 29.0.50 (<a href="https://orgmode.org">Org</a> mode 9.5.4)</p>
</div>
</body>
</html>
